[
    {
      "bookId": "1",
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/y8n6JSZ/67-150p-01.jpg",
      "review": "A captivating portrayal of the Jazz Age.Amidst the glitz and glamour of the Roaring Twenties, our narrative follows a cast of characters whose lives intertwine amidst the swirling rhythms of jazz and the clinking of cocktail glasses. From the enigmatic figures of the Harlem Renaissance to the wealthy socialites of the Upper East Side, each embodies the spirit of an era characterized by rebellion and reinvention.",
      "totalPages": 180,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["Classic", "Literature"],
      "publisher": "Scribner",
      "yearOfPublishing": 1925
    },
    {
      "bookId": "2",
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/cv8B8ws/19021605.jpg",
      "review": "A timeless exploration of justice and morality.Set against a backdrop that transcends time and place, our narrative follows a diverse cast of characters grappling with the complexities of right and wrong, virtue and vice. From the halls of power to the streets of the downtrodden, each encounter serves as a prism through which to examine the nature of justice in its myriad forms.",
      "totalPages": 281,
      "rating": 4.8,
      "category": "Fiction",
      "tags": ["Classic", "Southern Gothic"],
      "publisher": "J.B.Lippincott.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": "3",
      "bookName": "Catcher and Whitehall",
      "author": "George Orwell",
      "image": "https://i.ibb.co/hKJ0BMj/1-1.jpg",
      "review": "A dystopian masterpiece that remains eerily relevant.Set in a not-so-distant future, the story follows a cast of characters navigating the oppressive regime that governs their every move. At the heart of this society lies a sprawling metropolis, its gleaming towers masking a web of corruption and control.At the heart of this society lies a sprawling metropolis, its gleaming towers masking a web of corruption and control.",
      "totalPages": 328,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Dystopian", "Political Satire"],
      "publisher": " Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": "4",
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/12ncJ3b/top-view-pile-books.jpg",
      "review": "An iconic coming-of-age novel that captures teenage angst.Amidst the backdrop of opulent wealth and genteel manners, we encounter a cast of characters whose lives intertwine in a delicate dance of courtship and scandal. At the forefront are the protagonists, whose hearts are entangled in a whirlwind of emotions. They navigate the intricate rules of society with grace and charm, all while battling their own desires and the expectations of those around them.",
      "totalPages": 224,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["Classic", "Cynical"],
      "publisher": " Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": "5",
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/8Yv86cw/english-language-books-assortment.jpg",
      "review": "A witty and romantic portrayal of 19th-century English society.Enter our protagonist, a dashing gentleman of refined tastes and sharp intellect, navigating the intricacies of high society with effortless grace. He is the epitome of the Victorian gentleman: well-educated, impeccably dressed, and possessed of a razor-sharp wit that cuts through the veneer of propriety.",
      "totalPages": 279,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["Classic", "Romance"],
      "publisher": "T.Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": "6",
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/8NTK62D/kindpng-7318921.jpg",
      "review": "An enchanting adventure through Middle-earth.Our journey begins with a humble hobbit named Frodo Baggins, tasked with a perilous quest to destroy a powerful ring that threatens to plunge the world into darkness. With a fellowship of diverse companions by his side including the wise wizard Gandalf, the valiant Aragorn, and the loyal Samwise Gamgee Frodo embarks on a journey fraught with danger and discovery.",
      "totalPages": 310,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["Adventure", "Epic Fantasy"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1937
    }
  ]
  